app/views/food/donor.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
<body>
  <%@user = User.find(session[:user_id]) %>

SELECT `events`.* FROM `events`
---
				<tbody>
					<%Event.all.each do |event|%>

SELECT `orders`.* FROM `orders` WHERE `orders`.`event_id` = 1
---
							<td><%= event.available_meals%></td>
							<td><%= event.available_meals - event.orders.collect{|x| x.no_of_meals}.sum%></td>

SELECT `orders`.* FROM `orders`
---
	       	<tbody>
	       	 <%Order.all.each do |order|%>