app/views/food/receiver.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
<body>
  <%@user = User.find(session[:user_id]) %>

SELECT `orders`.* FROM `orders` WHERE (receiver_user_id = 1)
---
					<tbody>
					<% Order.where("receiver_user_id = #{session[:user_id]}").each do |order| %>