app/controllers/food_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`phone_number` = '7204225176' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`phone_number` = NULL LIMIT 1
---
  def login_action
  	response = {}
  	username = params[:user]
  	password = params[:password]
  	user = User.find_by_phone_number(username.to_i)
  	p user
  	if user.present? && user.password == password

SELECT `orders`.* FROM `orders` WHERE `orders`.`event_id` = 1
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
  def get_order_details
  	result = []
  	orders = Event.find_by_id(params[:event_id]).orders
  	orders.each do |order|

INSERT INTO `orders` (`receiver_user_id`, `donor_user_id`, `no_of_meals`, `event_id`) VALUES (1, 3, 1, 5)
---
	def send_message(to,token)
		account_sid = 'AC94a35860e3eff571097ba9b0b8723bd0'
		auth_token = '8200d6c7147f78dd987e35d4accf20ff'
		client = Twilio::REST::Client.new(account_sid, auth_token)
		from = '+12018796930' # Your Twilio number
		# to = '+917204225176' # Your mobile phone number
		client.messages.create(
			from: from,
			to: "+91"+to,
			body: "Hey! donor is waiting.Please use #{token} to order food"
		)

SELECT  `events`.* FROM `events` WHERE `events`.`event_code` = 'YlUtIb' LIMIT 1
---
	def create_order(params)
		code = params[:event_code]
		event = Event.find_by_event_code(code)