app/controllers/food_controller.rb

	def create_event(params)
		location = params[:location]
		available_meals = params[:available_meals]
		pno = params[:phone_number]
	    email_id = params[:email_id]
	    donor_user_id = params[:donor_user_id]
	    event_code = generate_event_code
	    event_status = "Active"
	    Event.create(location: => location,:available_meals => available_meals,:phone_number => pno,:email_id => email_id,:donor_user_id => donor_user_id,:event_code => event_code,:status => event_status)
	    User.find_all_by_user_type("Receiver").each do |user|
---
INSERT INTO `events` (`location`, `available_meals`, `phone_number`, `email_id`, `donor_user_id`, `event_code`, `status`) VALUES ('Adugodi', 23, '9972546989', 'shubendra.pinge@pramata.com', 3, 'TIjZlp', 'Active')
SELECT `users`.* FROM `users` WHERE (user_type = 'Receiver')